import KeepButton from "./KeepButton";
import ScanMoreItem from "./ScanMoreItem";
import BackToHome from "./BackToHome";
import { useEffect, useState } from "react";

import Pic1 from "@/assets/onsite/1_hd.webp";
import Pic2 from "@/assets/onsite/2_hd.webp";
import Pic3 from "@/assets/onsite/3_hd.webp";
import Pic4 from "@/assets/onsite/4_hd.webp";
import Pic5 from "@/assets/onsite/5_hd.webp";
import Pic6 from "@/assets/onsite/6_hd.webp";
import Pic7 from "@/assets/onsite/7_hd.webp";
import Pic8 from "@/assets/onsite/8_hd.webp";
import Pic9 from "@/assets/onsite/9_hd.webp";
import Pic10 from "@/assets/onsite/10_hd.webp";
import Pic11 from "@/assets/onsite/11_hd.webp";
import Pic12 from "@/assets/onsite/12_hd.webp";
import Pic13 from "@/assets/onsite/13_hd.webp";
import Pic14 from "@/assets/onsite/14_hd.webp";
import Pic15 from "@/assets/onsite/15_hd.webp";
import Pic16 from "@/assets/onsite/16_hd.webp";
import Pic17 from "@/assets/onsite/17_hd.webp";
import Pic18 from "@/assets/onsite/18_hd.webp";
import Pic19 from "@/assets/onsite/19_hd.webp";
import Pic20 from "@/assets/onsite/20_hd.webp";
import Pic21 from "@/assets/onsite/21_hd.webp";
import Pic22 from "@/assets/onsite/22_hd.webp";
import Pic23 from "@/assets/onsite/23_hd.webp";
import Pic24 from "@/assets/onsite/24_hd.webp";

const ShowItem = () => {
  const [id, setId] = useState(1);

  useEffect(() => {
    const queryParams = new URLSearchParams(window.location.search);
    const item = queryParams.get("item");

    const index = validItems.indexOf(item ?? "");

    if (index !== -1) {
      setId(index + 1); // To return 1-based index
    } else {
      setId(1);
    }
  }, []);

  return (
    <>
      <h1
        style={{
          textShadow:
            "0px 0px 3px rgba(255, 255, 255, 0.7), 0px 0px 6px #000000",
        }}
        className={`${[3, 9, 10, 11, 21, 23].includes(id) ? "mercy-font text-4xl" : "font-taviraj text-2xl"} mt-8 mb-8 text-white`}
      >
        {name[id - 1]}
      </h1>
      <img
        src={ImageSrc[id - 1].src}
        alt="Obj"
        className="mb-8 h-[189px] w-[226px] object-cover"
      />
      <div
        style={{
          textShadow: "0px 4px 4px rgba(0, 0, 0, 0.35)",
          background: "rgba(255, 255, 255, 0.1)",
        }}
        className="font-taviraj relative mb-8 flex h-fit max-h-[170px] w-[341px] flex-col items-center justify-center gap-[10px] overflow-y-auto rounded-xl bg-white text-center text-[15px] font-medium text-white"
      >
        <p className="h-full w-full px-4 py-4">{description[id - 1]}</p>
      </div>
      <div className="flex flex-col gap-4  w-full px-6 items-center justify-center gap-1">
      <KeepButton id={id.toString()} />
        <BackToHome />
      </div>
    </>
  );
};

export default ShowItem;

export const validItems = [
  "GiayIXyCl5QPXQ0", // 1
  "JQUEpHuuPtdlLvH", // 2
  "6FIg7YzPFm1zPBD", // 3
  "hMX8EJ4Lfnz3R69", // 4
  "LxobcMmpFO2HSpk", // 5
  "mLyLdemBURc3eLz", // 6
  "JxcxGvmp8xInfOt", // 7
  "AL53zVin0kmV30i", // 8
  "T3ja3WipSLazVUo", // 9
  "C2GmdJ3X5Fk80SD", // 10
  "bLSiOuNkTccAmFl", // 11
  "hMc6HnUIV03pueL", // 12
  "97z2Fs2owRRVqLJ", // 13
  "vk7pCME6UVdUI4S", // 14
  "xZsVKAtbWlIIKja", // 15
  "eIXcX0wtQhCvRwI", // 16
  "vQvRitjRTYVPo8k", // 17
  "lHXygzXlZ3HD5y7", // 18
  "Bts5CpygBY8myiU", // 19
  "Ej3mokegBZzVywJ", // 20
  "4KGP2TXpe9MSbo6", // 21
  "VWXMFoY7dhMZK8S", // 22
  "PrJDq2rZQZGReW0", // 23
  "uQXERK6hZq1TbVg", // 24
  "afJ2I3cbRZWBBND", // 25
];

export const ImageSrc = [
  Pic1,
  Pic2,
  Pic3,
  Pic4,
  Pic5,
  Pic6,
  Pic7,
  Pic8,
  Pic9,
  Pic10,
  Pic11,
  Pic12,
  Pic13,
  Pic14,
  Pic15,
  Pic16,
  Pic17,
  Pic18,
  Pic19,
  Pic20,
  Pic21,
  Pic22,
  Pic23,
  Pic24,
];

const name = [
  "หมากฝรั่งย้อนวัย",
  "ขนมช็อกโกเเลต",
  "Ring Pop",
  "การ์ดยูกิหนึ่งเดค",
  "กล่องเกมกระดานคร่ำครึ",
  "เกมกระดานหมากฮอส",
  "เกมบันไดงู",
  "ของเล่นวัยประถม",
  "Furby",
  "Tamagotchi",
  "Fidget Spinner",
  "เครื่องเกมบอยที่เริ่มจะเป็นสีแกมเหลือง",
  "สีไม้ ไปแบบไหนไม่เคยกลับมาแบบนั้น",
  "สีเทียน เรียงไม่เคยตรง หายตลอด",
  "ตุ๊กตางานวัด",
  "การ์ตูนวัยเด็ก",
  "กล่องดินสอสุดยิ่งใหญ่",
  "เครื่องเขียนคู่ใจ",
  "ลูกเสือ Starter Kit",
  "สมุคสามเล่มติดกระเป๋านักเรียน",
  "Lifetime Checkpoint",
  "กระดาษคำตอบแบบกา",
  "Your Star",
  "นกกระดาษ",
];

const description = [
  `จำกันได้ไหมหมากฝรั่งสมัยเก่า ไม่ว่าจะเป็น 
    หมากฝรั่งทุตตี้ ฟรุตตี้ ตรานกแก้ว 
    เนื้อเหนียว หวานฉ่ำ หลากหลายรส หรือหมากฝรั่งบุหรี่แมวที่เอามาคาบเล่นเฟี้ยวๆ เคี้ยวเพลินๆ ม้วนมาหลายๆ แท่งในกล่องเดียวกัน`,
  `บอกเลยขนมอันนี้กินได้เรื่อยๆ 
ขนาดกระทัดรัด รสชาติดี หวานกลมกล่อม มีรูปร่างมากมายหลากหลาย รูปหินบ้าง รูปทรงกลมๆ เป็น Chocoball บ้าง  ใหม่ขึ้นมาหน่อยก็สีเหลี่ยม 
เช่น Milo cube เห็นแล้วอยากกินด้วยเลย`,
  `ลูกอมหลากหลายรสชาติที่อยู่ในรูปแบบของแหวน 
เด็กๆ หลายๆ คนชอบเอามาใส่เล่นกัน ให้ฟีลเจ้าหญิงเจ้าชายน่ารักๆ รสชาติคือละมุนสุด มีทั้งหวานและเปรี้ยว อมเพลินๆ สดชื่นเวอร์ สมัยเด็กใครไม่เคยลองเนี่ยถือว่าพลาดมากๆ`,
  `Ore no TURN!!! ถ้าพูดถึงเกมการ์ดสมัยเด็ก ก็คงจะไม่พูดถึงการ์ดยูกิ (Yu-Gi-Oh!) ไม่ได้ ไพ่ยูกิเด็คนี้ที่ตั้งใจสะสม เริ่มเปื่อยยุ่ยตามกาลเวลา แต่ถึงแม้ว่าจะผ่านไปกี่ปี ความทรงจำอันแสนสนุก
และความน่าดึงดูดในการจั่วไพ่ขึ้นมาก็ยังคงเหมือนเดิม`,
  `ดูคล้ายจะเป็นเกมเศรษฐียุคสมัยก่อน เห็นแล้วอยากจะพูดว่า “สร้าง Landmark!” นึกถึงตอนที่ทอยลูกเต๋าไปลงบ้านของเพื่อน แล้วต้องจ่ายค่าเช่าวันละ 400 บาทเลย...`,
  `หมากฮอส เกมสุดคลาสสิคที่ชนะใจหลายๆ คน อุปกรณ์ก็หาง่าย แค่หยิบกระดาษมาตีตาราง
แล้วหาฝาขวดน้ำรอบตัวมา 16 อันก็เล่นได้แล้ว! กติกาการเล่นก็เบสิคมากๆ เรียกได้ว่าเป็นเกมวางแผน
ที่ได้ใช้ทั้งความคิด และได้รับความสนุกกลับไปจริงๆ`,
  `เกมนี้คือลุ้นดวงมาก ทอยลูกเต๋าแต่ละครั้ง
แทบกลั้นใจไม่ไหว ความรู้สึกตอนทอยลูกเต๋าแล้ว
ต้องขยับตัวไปทีละช่องนี่มันน่าตื่นเต้นมากๆ พอได้ขึ้นบันไดยาวๆ นี่รู้สึกดีมากๆ แต่พอตกช่องหัวงูแล้วต้องถอยลงมาเนี่ยมันเศร้าจริงๆ`,
  `ของเล่นวัยเด็กแบบมันส์ๆ เป็นอะไรไปไม่ได้
นอกจากเกมโดดยาง ที่เพื่อนๆ ชอบมาโชวความพริ้ว เกมหมุนลูกข่าง ที่มีวิธีเล่นแบบง่ายๆคือใช้เชือกพันรอบ แล้วหมุนแข่งกับเพื่อนๆ และเกมลูกแก้ว ซึ่งสามารถเล่นหลายแบบ ไม่ว่าจะเป็นในรางดินนํ้ามัน หรือหยอดลูกแก้วลงไปในช่องต่างๆ 
เห้อ... เห็นแล้วก็คิดถึงเหมือนกันนะ`,
  `เป็นไอเท็มในตํานานที่ทุกคนต้องมี!! น้องเป็นตุ๊กตาที่สามารถโต้ตอบได้ 
ขยับตา กระพริบตาได้จริง บอกเลยว่าใครที่กําลังอยากได้เพื่อนคุย มีน้องแล้วไม่เหงาแน่นอน`,
  `ของเล่นรูปไข่สุดน่ารักจากญี่ปุ่น ให้เราได้รับผิดชอบชีวิตสัตว์เลี้ยง ซึ่งสามารถทำได้ตั้งแต่ให้อาหาร อาบน้ำ หรือเล่นด้วย มีแล้วบอกเลยว่าจะเท่มาก คุยโม้กับเพื่อนได้ทั้งวัน
 ใครๆ ก็อยากมีติดกระเป๋าไว้เล่นในเวลาว่าง`,
  `Fidget Spinner มีช่วงนึงฮิตกันมากกก ทุกคนในโรงเรียนหมุนติดนิ้วกันตลอดเวลา
รูปร่างก็มีหลายแบบ แต่ส่วนใหญ่ก็จะคล้ายกับ
จานแผ่นเรียบที่มีรูตรงกลาง แล้วเราก็จะเอานิ้วสองนิ้ว
มาจับที่ตรงกลางแล้วหมุนด้วยความเร็วแสง!`,
  `เครื่องเกมประเภทพับได้สุดเท่ห์ มักพร้อมกับเคสยางสุดน่ารัก และถุงใส่ตลับเกมดังๆ 
เช่น Kirby's Dream land, Super Mario DX, และ Pokemon ตลับฟ้า และแน่นอนว่าพอเลือกเกมได้แล้ว ก็จะต้องเป่าตลับ 1 ทีก่อนเปิดเครื่องเพื่อสิริมงคล!`,
  `อุปกรณ์ระบายสีคู่ใจในวัยเด็ก
เวลาซื้อนี่ต้องมีมากกว่า 24 สี ใช้เสร็จแล้วต้อง
เรียงลำดับสีให้สวยก่อนเก็บ แต่พอให้เพื่อนยืมไปทีไร ได้คืนกลับมาไม่เคยเหมือนเดิมเลย ทำหายบ้างล่ะ เรียงสีสลับบ้างล่ะ น่าเศร้าจริงๆ `,
  `อุปกรณ์ระบายสีในวัยเด็ก บางครั้งคุณครูให้ทำงานก็เลยต้องซื้อสีเทียนมาใช้ ระบายสนุกมากมือเปลี่ยนสีตลอดหลังทำงานเสร็จ แต่บางครั้งมีเพื่อนลืมเอามาแล้วขอยืมใช้ พอตอนได้สีคืนมา แท่งสีก็หักไปซะแล้ว... `,
  `กว่าจะได้ตุ๊กตางานวัดแต่ละตัวยากมาก เล่นเกมเสียเงินแทบตายแต่พอได้มาแล้วใจฟูมาก แต่ถ้ามีคนมาเล่นเกมชิงตุ๊กตาให้เราก็ดีนะ โดยตุ๊กตารางวัลมามักจากเกมในงานวัดเช่น 
เกมยิงปืน ปาโป่ง สาวน้อยตกน้ำ ตักไข่ การเล่นเกมเก็บตุ๊กตาเป็นสเน่ห์ของงานงานวัดจริงๆ`,
  `หนังสือการ์ตูนสุดฮิตที่ครองใจเด็กไทยหลายๆ คน 
สมัยก่อนราคาเล่มละ 10 กว่าบาทเพียงเท่านั้น ออกสัปดาห์ละเล่ม ว่างๆ ชอบเอาไปนั่งอ่านกับเพื่อนๆ ถึงแม้ว่าจะเป็นการ์ตูนไซส์เล็ก แต่มุกตลกรับรองได้เลยว่าเข้าเส้นใครหลายๆ คนแน่นอน`,
  `บอกเลยว่ากล่องดินสอเราต้องเท่ที่สุดในห้อง ไม่เพียงแต่ลายต้องเฟี้ยว แต่ฟังก์ชันการทำงาน
ต้องเยอะกว่ากล่องดินสอเพื่อนด้วย ไม่ว่าจะเป็นกล่อง 2 ชั้น เปิดปิดด้วยเเม่เหล็ก มีช่องลับในกล่องดินสอ กดปุ่มแล้วมีกบเหลาดินสอโผล่ออกมา สารพัดอย่างจริงๆ!`,
  `เครื่องเขียนสุดฮ็อตในตํานาน ไม่ว่าจะเป็น ไม้บรรทัดเยลลี่ที่บิดได้ งอได้ ไม่หัก ยางลบแองกี้เบิร์ดแบบคิ้วๆ จิ๋วๆ แค่ได้มองหน้าน้องก็มีกําลังใจเรียนต่อ และดินสอเปลี่ยนไส้ที่นั่งสลับไส้ไปมาไม่เว้นวัน 
บอกเลยว่าเป็นเครื่องเขียนคู่ใจติดกระเป๋าดินสอเลย!`,
  `ของที่ขาดไม่ได้เวลาเรียนลูกเสือ/เนตรนารี ทุกคนต้องมี
ทั้งหมวก ผ้าพันคอพร้อมว้อกเกิ้ล และเชือกคู่ใจที่
ไม่มีใครขาดได้ เพราะจะโดนยืนหน้าเสาธง! 
ทุกๆวันในสัปดาห์ จะต้องหาเชือกลูกเสือกันจนตาแตก เพราะต้องผูกเงื่อน 1 เงื่อน ส่งอาจารย์`,
  `เป็นสมุดสามเล่มติดกระเป๋าเด็กประถมวัยทุกคน 
ประกอบไปด้วย สมุดจดการบ้าน สมุดบันทึกความดี และสมุดรักการอ่าน เชื่อว่าหลายๆ คนน่าคุ้นเคยกับมันดีเพราะเป็นสมุด 3 เล่ม
ที่เต้องเขียนมือหงิกส่งคุณครูในทุกๆ เทอม`,
  `การสอบ ไม่ว่าจะเป็นการสอบแข่งขันต่างๆ หรือสอบเข้าโรงเรียนมัธยมหรือมหาวิทยาลัย ก็ถือเป็น Checkpoint จุดใหญ่ในชีวิต มีหลายคนที่สมหวัง และมีหลายคนที่ผิดหวัง แต่ไม่ว่าผลจะเป็นอย่างไร คุณก็ได้ทำอย่างเต็มที่แล้ว ประสบการณ์ที่ได้รับมา คุณได้เรียนรู้อะไรจากมันอย่างแน่นอน`,
  `กระดาษข้อสอบแบบกา = ของมันต้องเจอทุกเทอม เป็นของคู่กับกระดาษตรวจคําตอบ ที่มีการเจาะรูคําตอบที่ถูกไว้ แล้วเอามาซ้อนดูว่าได้กี่คะแนน หลายๆ คนตั้งใจกากันแบบสวยเป๊ะ แต่เราเจอเมื่อไหร่ ใจสั่นทุกรอบ ไม่ใช่เพราะเธอ แต่เพราะกลัวเบลอไปกาผิดช่อง`,
  `วันนี้เหนื่อยใช่มั้ย มาพักใจตรงนี้นะ กว่าดวงดาวจะขึ้นพ้นขอบฟ้า ก็ผ่านโลกมาครึ่งซีก ดังนั้น พักให้หายเหนื่อย ใช้เวลากับตัวเองให้เต็มที่ จะได้เป็นตัวเองที่เปล่งประกายอย่างสวยงาม
เหมือนกับดวงดาวที่เปล่งประกายบนฟากฟ้ายามราตรีนะ`,
  `ในบางความเชื่อนกกระดาษคือสัญลักษณ์แห่งโชคลาภ ความสุข และการมีอายุยืนยาว ในเรื่องราวของหลายๆ คน คงมีนกกระดาษ
ตัวนี้อยู่ อาจเป็นความทรงจำเล็กๆ ที่ได้พับกระดาษกับเพื่อน 
หากคุณมีช่วงเวลาที่กังวล สิ้นหวัง ไม่รู้ว่าควรทำอะไรต่อไป ทำได้แค่หวังว่ามันจะดีขึ้น คุณสามารถขอพรกับนกกระดาษตัวนี้ได้นะ! นกตัวนี้จะนำคำอธิษฐานของคุณไปส่งให้กลายเป็นจริง`,
];
